Revit 2027 API
ReferenceArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ReferenceArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As ReferenceArrayIterator
public:
virtual ReferenceArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> ReferenceArrayIterator
override ForwardIterator : unit -> ReferenceArrayIterator
Return Value
ReferenceArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
ReferenceArray Class
Autodesk.Revit.DB Namespace